InformationRegisters/МатериальноОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МатериальноОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗонаОтветственности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/МатериальноОтветственныеЛица/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура СоздатьКомандуМатериальнаяОтветственностьВФормеСотрудника(Форма, ИмяГруппы) Экспорт
	
	Если Не (ПолучитьФункциональнуюОпцию("УчитыватьМатериальнуюОтветственностьСотрудников")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОформленПоТрудовомуДоговору")
		И Форма.ОформленПоТрудовомуДоговору) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.МатериальноОтветственныеЛица) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьРеквизитыМатериальнаяОтветственность(Форма);
	ДобавитьКомандуМатериальнаяОтветственность(Форма, ИмяГруппы);
	
КонецПроцедуры

// Обрабатывает событие ПередЗаписью модуля набора записей регистра МатериальноОтветственныеЛица.
//
// Параметры:
//  НаборЗаписей - РегистрСведенийНаборЗаписей - набор записей для обработки.
//  Отказ - Булево - признак отказа от записи.
//  Замещение - Булево - режим записи набора.
//
Процедура МатериальноОтветственныеЛицаПередЗаписью(НаборЗаписей, Отказ, Замещение) Экспорт
	
	Если НаборЗаписей.Количество() = 0 Или ОбщегоНазначения.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		МатериальнаяОтветственностьФизическихЛиц = МатериальноОтветственныеЛицаВызовСервера.ПроверкаМатериальнойОтветственностиФизическихЛиц(
			Запись.Организация,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Запись.ФизическоеЛицо),
			Ложь);
		
		Если МатериальнаяОтветственностьФизическихЛиц.Количество() > 0 Тогда
			ТекстСообщения =
				НСтр("ru = 'Материальная ответственность уже зарегистрирована по этому сотруднику, измените текущую запись.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;
		
	КонецЦикла
	
КонецПроцедуры

#Область НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.МатериальноОтветственныеЛица);
	
КонецПроцедуры

#КонецОбласти

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	// ЗарплатаКадрыПриложения.МатериальноОтветственныеЛица
	Списки.Вставить(Метаданные.РегистрыСведений.МатериальноОтветственныеЛица, Истина);
	// Конец ЗарплатаКадрыПриложения.МатериальноОтветственныеЛица
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРеквизитыМатериальнаяОтветственность(Форма)
	
	МассивИменРеквизитовФормы = Новый Массив;
	ДобавляемыеРеквизиты = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("МатериальнаяОтветственность", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.МатериальноОтветственныеЛица")));
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
КонецПроцедуры

Процедура ДобавитьКомандуМатериальнаяОтветственность(Форма, ИмяГруппы)
	
	ИмяКоманды = "РедактированиеМатериальнойОтветственности";
	
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Заголовок = НСтр("ru = 'Материальная ответственность'");
	Команда.Действие = "Подключаемый_МатериальнаяОтветственность";
	
	Группа = Форма.Элементы.Найти(ИмяГруппы);
	
	Если Группа <> Неопределено Тогда
		Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Группа);
		Кнопка.Вид = ВидКнопкиФормы.Гиперссылка;
		Кнопка.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
КонецПроцедуры

#Область ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.МатериальноОтветственныеЛица) Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики.Добавить(МатериальноОтветственныеЛица);
	
КонецПроцедуры

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.МатериальноОтветственныеЛица) Тогда
		Возврат;
	КонецЕсли;
	
	Период = ТекущаяДатаСеанса();
	НачалоПериода = НачалоДня(Период);
	КонецПериода = НачалоПериода + 14 * 86400;
	
	Раздел							= "МатериальнаяОтветственность";
	ПредставлениеЗаголовка			= НСтр("ru = 'Материальная ответственность'");
	Представление					= НСтр("ru = 'Контроль передачи материальных ценностей по увольняемым'");
	Подсказка						= НСтр("ru = 'Проконтролировать передачу материальных ценностей по увольняемым.'");
	
	ДелоЗаголовок					= ТекущиеДела.Добавить();
	ДелоЗаголовок.Идентификатор		= Раздел;
	ДелоЗаголовок.Важное			= Ложь;
	ДелоЗаголовок.Владелец			= Метаданные.Подсистемы.Найти("Кадры");
	ДелоЗаголовок.Представление		= ПредставлениеЗаголовка;
	ДелоЗаголовок.Подсказка			= ПредставлениеЗаголовка;
	ДелоЗаголовок.ЕстьДела			= Ложь;
	ДелоЗаголовок.Форма				= "Отчет.МатериальноОтветственныеЛица.Форма";
	
	ПараметрыФормы				= Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "МатериальноОтветственныеЛица");
	
	СоответствиеОтборов = Новый Соответствие;
	СоответствиеОтборов.Вставить("ДатаУвольнения", НачалоПериода);
	СоответствиеОтборов.Вставить("НеАктуален", Истина);
	ПользовательскиеНастройкиОтчета = КадровыйУчетРасширенный.ПользовательскиеНастройкиОтчетаПоСотрудникам(
		"МатериальноОтветственныеЛица",
		"МатериальноОтветственныеЛица",
		СоответствиеОтборов);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройкиОтчета);
	
	ДелоЗаголовок.ПараметрыФормы = ПараметрыФормы;
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	Если МодульТекущиеДелаСервер.ДелоОтключено(Раздел) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	МатериальноОтветственныеЛица.Организация КАК Организация,
		|	МатериальноОтветственныеЛица.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТМатериальноОтветственныеЛица
		|ИЗ
		|	РегистрСведений.МатериальноОтветственныеЛица КАК МатериальноОтветственныеЛица
		|ГДЕ
		|	НЕ МатериальноОтветственныеЛица.НеАктуален";
	
	Запрос.Выполнить();
	
	ПараметрыПолученияСотрудников =
		КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
	ПараметрыПолученияСотрудников.ИмяВТФизическиеЛица = "ВТМатериальноОтветственныеЛица";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ПараметрыПолученияСотрудников,
		"ВТСотрудникиФизическихЛиц");
		
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		Запрос.МенеджерВременныхТаблиц,
		"ВТСотрудникиФизическихЛиц");
	
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
		ОписательВременныхТаблиц,
		Истина,
		"Организация, ФизическоеЛицо, ДатаУвольнения");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыеДанныеСотрудников.Организация КАК Организация,
		|	КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	КадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	ВТМатериальноОтветственныеЛица КАК МатериальноОтветственныеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО МатериальноОтветственныеЛица.Организация = КадровыеДанныеСотрудников.Организация
		|			И МатериальноОтветственныеЛица.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
		|ГДЕ
		|	КадровыеДанныеСотрудников.ДатаУвольнения МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация";
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ДанныеОрганизаций = Новый Соответствие;
	
	Пока Выборка.СледующийПоЗначениюПоля("Организация") Цикл
		Организация = Выборка.Организация;
		Сотрудники = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Сотрудники.Добавить(Выборка.Сотрудник);
		КонецЦикла;
		ДанныеОрганизаций.Вставить(Организация, Сотрудники);
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ДанныеОрганизаций Цикл
		
		Организация = КлючИЗначение.Ключ;
		
		Дело				= ТекущиеДела.Добавить();
		Дело.Идентификатор	= "МатериальнаяОтветственность" + СтрЗаменить(Организация.УникальныйИдентификатор(), "-", "");
		Дело.ЕстьДела		= Истина;
		Дело.Важное			= Ложь;
		Дело.Владелец		= Раздел;
		Дело.Представление	= Представление + ", " + Строка(Организация);
		Дело.Количество		= Сотрудники.Количество();
		Дело.Подсказка		= Подсказка;
		Дело.Форма			= "Отчет.МатериальноОтветственныеЛица.Форма";
		
		ПараметрыФормыПоОрганизации = Новый Структура;
		ПараметрыФормыПоОрганизации.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормыПоОрганизации.Вставить("КлючВарианта", "МатериальноОтветственныеЛица");
		
		СоответствиеОтборов = Новый Соответствие;
		СоответствиеОтборов.Вставить("Организация", Организация);
		СоответствиеОтборов.Вставить("ДатаУвольнения", НачалоПериода);
		СоответствиеОтборов.Вставить("НеАктуален", Истина);
		ПользовательскиеНастройкиОтчета = КадровыйУчетРасширенный.ПользовательскиеНастройкиОтчетаПоСотрудникам(
			"МатериальноОтветственныеЛица",
			"МатериальноОтветственныеЛица",
			СоответствиеОтборов);
		ПараметрыФормыПоОрганизации.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройкиОтчета);
		
		Дело.ПараметрыФормы = ПараметрыФормыПоОрганизации;
		
		ДелоЗаголовок.ЕстьДела = Истина;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
